Aula 2 - configurando ambiente python

In [1]:
print("Inteligencia Artificial Big Data - 2")

Inteligencia Artificial Big Data - 2

In [2]:
!pip install pandas

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pandas in c:\users\dsadm\appdata\roaming\python\python313\site-packages (2.3.1)
Requirement already satisfied: numpy>=1.26.0 in c:\users\dsadm\appdata\roaming\python\python313\site-packages (from pandas) (2.3.2)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\dsadm\appdata\roaming\python\python313\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\dsadm\appdata\roaming\python\python313\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\dsadm\appdata\roaming\python\python313\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\dsadm\appdata\roaming\python\python313\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

In [3]:
import pandas as pd

In [ ]:
Dicionario = {
    'A':[1,2,3],
    'B':[-3,-2,-1],
    'C':[0,10,20]
}

Label = ['1 linha','2 linha','3 linha']

Dataframe_1 = pd.DataFrame(Dicionario,index=Label)
print(Dataframe_1)

         A  B   C
1 linha  1 -3   0
2 linha  2 -2  10
3 linha  3 -1  20

In [ ]:
Dataframe_1[['A','B']]

         A  B
1 linha  1 -3
2 linha  2 -2
3 linha  3 -1

In [8]:
Dataframe_1[['A','C']]

         A   C
1 linha  1   0
2 linha  2  10
3 linha  3  20

In [10]:
Dataframe_1['Nova coluna'] = Dataframe_1['A'] * Dataframe_1['B']
Dataframe_1

         A  B   C  Nova coluna
1 linha  1 -3   0           -3
2 linha  2 -2  10           -4
3 linha  3 -1  20           -3

In [29]:
Dataframe_1.drop('Nova coluna',axis=1)

KeyError: "['Nova coluna'] not found in axis"

In [21]:
Dataframe_1.loc['1 linha']

A    1
B   -3
C    0
Name: 1 linha, dtype: int64

In [32]:
Dataframe_1.loc[['2 linha','3 linha'],['A','B']]

         A  B
2 linha  2 -2
3 linha  3 -1

In [33]:
Dataframe_1.head()

         A  B   C
1 linha  1 -3   0
2 linha  2 -2  10
3 linha  3 -1  20

In [39]:
Dataframe_1.iloc[2:3,1:]

         B   C
3 linha -1  20

In [41]:
Filtro = Dataframe_1['C']>0
Dataframe_2 = Dataframe_1[Filtro]
Dataframe_2

         A  B   C
2 linha  2 -2  10
3 linha  3 -1  20

In [42]:
Filtro

1 linha    False
2 linha     True
3 linha     True
Name: C, dtype: bool

In [47]:
Dataframe_1[(Dataframe_1['A']>1)& (Dataframe_1['C']>0)]

         A  B   C
2 linha  2 -2  10
3 linha  3 -1  20

In [45]:
Dataframe_1[(Dataframe_1['A']>5) | (Dataframe_1['C']>2)]

         A  B   C
2 linha  2 -2  10
3 linha  3 -1  20

In [48]:
Dataframe_1.reset_index()

     index  A  B   C
0  1 linha  1 -3   0
1  2 linha  2 -2  10
2  3 linha  3 -1  20

In [53]:
Dataframe_1.reset_index(inplace=True)

In [52]:
Dataframe_1

     index  A  B   C
0  1 linha  1 -3   0
1  2 linha  2 -2  10
2  3 linha  3 -1  20

In [ ]:
Dataframe_1.drop('index',axis=1,inplace= True)

   level_0  A  B   C
0        0  1 -3   0
1        1  2 -2  10
2        2  3 -1  20

In [55]:
Dataframe_1

   level_0  A  B   C
0        0  1 -3   0
1        1  2 -2  10
2        2  3 -1  20

In [ ]:

Dicionario_01 = {
    'A': [1,2,3],
    'B': [-32,-21,-15],
    'C': [60,10,20],
    'Chave': ['AA','BB','CC']
}

Dicionario_02 = {
    'A': [6,7,8],
    'B': [-39,-28,-17],
    'C': [1000,10,60],
    'Chave': ['AA','BB','CC']
}

Dicionario_03 = {
    'A': [11,12,13],
    'B': [-39,-22,-11],
    'C': [30,10,20],
    'Chave': ['AA','BB','CC']
}

Label_1 = ['1 linha', '2 linha', '3 linha']
Label_2 = ['4 linha', '5 linha', '6 linha']
Label_3 = ['7 linha', '8 linha', '9 linha']

Dataframe_01 = pd.DataFrame(Dicionario_01, index=Label_1)
Dataframe_02 = pd.DataFrame(Dicionario_02, index=Label_2)
Dataframe_03 = pd.DataFrame(Dicionario_03, index=Label_3)

DataFrame 1:
         A   B   C Chave
1 linha  1 -32  60    AA
2 linha  2 -21  10    BB
3 linha  3 -15  20    CC

DataFrame 2:
         A   B     C Chave
4 linha  6 -39  1000    AA
5 linha  7 -28    10    BB
6 linha  8 -17    60    CC

DataFrame 3:
          A   B   C Chave
7 linha  11 -39  30    AA
8 linha  12 -22  10    BB
9 linha  13 -11  20    CC

In [68]:
Dataframe_01

         A   B   C Chave
1 linha  1 -32  60    AA
2 linha  2 -21  10    BB
3 linha  3 -15  20    CC

In [69]:
pd.concat([Dataframe_01,Dataframe_02,Dataframe_03])

          A   B     C Chave
1 linha   1 -32    60    AA
2 linha   2 -21    10    BB
3 linha   3 -15    20    CC
4 linha   6 -39  1000    AA
5 linha   7 -28    10    BB
6 linha   8 -17    60    CC
7 linha  11 -39    30    AA
8 linha  12 -22    10    BB
9 linha  13 -11    20    CC

In [70]:
pd.merge(Dataframe_01,Dataframe_02,how='inner',on='Chave')

   A_x  B_x  C_x Chave  A_y  B_y   C_y
0    1  -32   60    AA    6  -39  1000
1    2  -21   10    BB    7  -28    10
2    3  -15   20    CC    8  -17    60

In [71]:
pd.merge(Dataframe_01,Dataframe_03,how='left',on='Chave')

   A_x  B_x  C_x Chave  A_y  B_y  C_y
0    1  -32   60    AA   11  -39   30
1    2  -21   10    BB   12  -22   10
2    3  -15   20    CC   13  -11   20

In [74]:
pd.merge(Dataframe_01,Dataframe_02,how='outer',on='Chave')

   A_x  B_x  C_x Chave  A_y  B_y   C_y
0    1  -32   60    AA    6  -39  1000
1    2  -21   10    BB    7  -28    10
2    3  -15   20    CC    8  -17    60

In [ ]:
dic1 = {
    'A': [1,2,3],
    'B': [-32,-21,-15],
    'C': [60,10,20],
}

dic2 = {
    'D': [6,7,8],
    'E': [-39,-28,-17],
    'F': [1000,10,60],
}

Label_01 = ['1 linha', '2 linha', '3 linha']

df01 = pd.DataFrame(dic1,index= Label_01)
df02 = pd.DataFrame(dic2,index= Label_01)

         A   B   C  D   E     F
1 linha  1 -32  60  6 -39  1000
2 linha  2 -21  10  7 -28    10
3 linha  3 -15  20  8 -17    60

In [85]:
df01

         A   B   C
1 linha  1 -32  60
2 linha  2 -21  10
3 linha  3 -15  20

In [86]:
df01.join(df02)

         A   B   C  D   E     F
1 linha  1 -32  60  6 -39  1000
2 linha  2 -21  10  7 -28    10
3 linha  3 -15  20  8 -17    60